kbra0010/Ultrasonic-PSoC/Ultrasonic Sensor Workspace/Ultrasonic Distance Meter.cydsn/Generated_Source/PSoC5/Button_Tie_High.h
/*******************************************************************************
* File Name: Button_Tie_High.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_Button_Tie_High_H) /* CY_CONTROL_REG_Button_Tie_High_H */
#define CY_CONTROL_REG_Button_Tie_High_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} Button_Tie_High_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    Button_Tie_High_Write(uint8 control) ;
uint8   Button_Tie_High_Read(void) ;

void Button_Tie_High_SaveConfig(void) ;
void Button_Tie_High_RestoreConfig(void) ;
void Button_Tie_High_Sleep(void) ; 
void Button_Tie_High_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define Button_Tie_High_Control        (* (reg8 *) Button_Tie_High_Sync_ctrl_reg__CONTROL_REG )
#define Button_Tie_High_Control_PTR    (  (reg8 *) Button_Tie_High_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_Button_Tie_High_H */


/* [] END OF FILE */
